VERSION = "1.0.0.8"

SCREEN_WIDTH = 1280
SCREEN_HEIGHT = 720
SCREEN_CENTER_X = 640
SCREEN_CENTER_Y = 360

# 本地游戏位置
WALK_BUTTON_CENTER_X = 209
WALK_BUTTON_CENTER_Y = 553

action_button_position = {
    "小技能": (865, 629),
    "大招": (949, 627),
    "魔灵技": (1094, 626),
    "近战攻击": (1112, 520),
    "远程攻击": (964, 499),
    "跳跃": (1083, 364),
    "闪避": (1226, 464),
    "换弹": (887, 528),
    "锁敌": (1214, 645),
    "下蹲": (51, 628),
}

# 交互文本区域
interaction_text_rect = {
    "单行":[653,324,944,385],
    "多行":[667,296,948,547]
}

# 云游戏位置
CLOUD_WALK_BUTTON_CENTER_X = 208
CLOUD_WALK_BUTTON_CENTER_Y = 551

cloud_action_button_position = {
    "小技能": (812,628),
    "大招": (901,626),
    "魔灵技": (1042,623),
    "近战攻击": (1063,521),
    "远程攻击": (916,498),
    "跳跃": (1037,359),
    "闪避": (1178,464),
    "换弹": (839,533),
    "锁敌": (1165,641),
    "下蹲": (104,644),
    "行走": (99,572),
}

# 交互文本区域
cloud_interaction_text_rect = {
    "单行":[673,331,945,380],
    "多行":[670,277,945,555]
}

skill_time = {
    "小技能":10,
    "小技能_释放时间":0,
    "大招":10,
    "大招_释放时间":0,
    "魔灵技":15,
    "魔灵技_释放时间":0
}